Tekla Open API Reference for Tekla Structures 2025
AnalysisNode.GetAnalysisNodeLinks Method
 Get analysis nodelinks connected to node.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetAnalysisNodeLinks()
Public Function GetAnalysisNodeLinks As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
Enumerator of analysis nodelinks connected to node.
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace